year = int(input('Вводите целое число в диапазоне 100–999 : '))

ones = {

    1 : 'один',
    2 : 'два',
    3 : 'три',
    4 : 'четыре',
    5 : 'пять',
    6 : 'шесть',
    7 : 'семь',
    8 : 'восемь',
    9 : 'девять'    

                       }

tens = {
    10 : 'десять ',
    20 : 'двадцать ',
    30 : 'тридцать ',
    40 : 'сорок ',
    50 : 'пятдесять ',
    60 : 'шестдесять ',
    70 : 'семдесять ',
    80 : 'восемдесять ',
    90 : 'девеноста '
   
}

hundreds = {
    100 : 'сто ',
    200 : 'двеста ',
    300 : 'триста ',
    400 : 'четиреста ',
    500 : 'пятсот ',
    600 : 'шестсот ',
    700 : 'семсот ',
    800 : 'восемсот ',
    900 : 'девятсот '
   
}



ten = int(((year // 10 ) % 10) * 10)
one = int(year % 10)
hundred = int((year // 100) * 100)

message = ''

if hundred in hundreds.keys():
    message += f'{hundreds[hundred]}' 

if ten  in tens.keys() :
    message += f'{tens[ten]}'
    
if one in ones.keys() :
    message += f'{ones[one]}' 

    
print(message)    




