command = int(input('''
Элементы равностороннего треугольника пронумерованы следую-
щим образом:
1 — сторона a,
2 — радиус R1 вписанной окружности
3 — радиус R2 описанной окружности 
4 — площадь S 
Вводите один из них :  '''))

types = {
    1 : 'сторона a',
    2 : 'радиус R1 вписанной окружности',
    3 : 'радиус R2 описанной окружности',
    4 : 'площадь S'
        }


if command in types.keys() : 
    value = float(input(f'Вводите {types[command]} : '))
    a, R1, R2, S = 0, 0, 0, 0

    if command == 1 :
        a = value
        R1 = a * (3 ** 1/2) / 6
        R2 = 2 * R1
        S = (a ** 2) * (3 ** 1/2) / 4
    
    elif command == 2 :
        R1 = value
        a = 2 * (3 ** 1/2) * R1
        R2 = 2 * R1
        S = (a ** 2) * (3 ** 1/2) / 4

    elif command == 3 :
        R2 = value
        R1 = R2 / 2
        a = 2 * (3 ** 1/2) * R1
        S = (a ** 2) * (3 ** 1/2) / 4
    
    elif command == 4 :
        S = value
        a = 2 * (S ** 1/2) / (3 ** 1/4)
        R1 = a * (3 ** 1/2) / 6
        R2 = 2 * R1
    
    print(f'''
    сторона a = {a},
    радиус R1 вписанной окружности = {R1}
    радиус R2 описанной окружности = {R2} 
    площадь S = {S}
    ''')

else :
    print('Такого команды нет')


    